; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l15_p15_c15_g15_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(person-at person1 loc3)
	(person-at person2 loc6)
	(person-at person3 loc11)
	(person-at person4 loc1)
	(person-at person5 loc11)
	(person-at person6 loc7)
	(person-at person7 loc10)
	(person-at person8 loc15)
	(person-at person9 loc1)
	(person-at person10 loc11)
	(person-at person11 loc10)
	(person-at person12 loc8)
	(person-at person13 loc9)
	(person-at person14 loc2)
	(person-at person15 loc12)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person2 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
	(has-content-person person9 food)
	(has-content-person person9 medicine)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person13 medicine)
	(has-content-person person14 medicine)
	(has-content-person person15 medicine)
))
)

; plan
1. (pick-up-crate crate15 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate15 depot)
   added: (has-crate-drone-arm drone1 right crate15)
   goals met: 1 of 16
2. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 depot)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 1 of 16
3. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 0 of 16
4. (drop-crate loc12 person15 crate15 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate15)
   added: (has-content-person person15 medicine) (empty-arm drone1 right)
   goals met: 1 of 16
5. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 2 of 16
6. (pick-up-crate crate14 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate14 depot)
   added: (has-crate-drone-arm drone1 right crate14)
   goals met: 2 of 16
7. (drone-move depot loc9 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc9)
   goals met: 1 of 16
8. (drop-crate loc9 person13 crate14 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate14)
   added: (has-content-person person13 medicine) (empty-arm drone1 right)
   goals met: 2 of 16
9. (drone-move loc9 depot drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 depot)
   goals met: 3 of 16
10. (pick-up-crate crate13 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate13 depot)
   added: (has-crate-drone-arm drone1 right crate13)
   goals met: 3 of 16
11. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 2 of 16
12. (drop-crate loc8 person12 crate13 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate13)
   added: (has-content-person person12 medicine) (empty-arm drone1 right)
   goals met: 3 of 16
13. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 4 of 16
14. (pick-up-crate crate12 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate12 depot)
   added: (has-crate-drone-arm drone1 right crate12)
   goals met: 4 of 16
15. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 3 of 16
16. (drop-crate loc7 person6 crate12 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate12)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 4 of 16
17. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 5 of 16
18. (pick-up-crate crate11 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate11 depot)
   added: (has-crate-drone-arm drone1 right crate11)
   goals met: 5 of 16
19. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 4 of 16
20. (drop-crate loc6 person2 crate11 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate11)
   added: (has-content-person person2 medicine) (empty-arm drone1 right)
   goals met: 5 of 16
21. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 6 of 16
22. (pick-up-crate crate10 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate10 depot)
   added: (has-crate-drone-arm drone1 right crate10)
   goals met: 6 of 16
23. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 5 of 16
24. (drop-crate loc2 person14 crate10 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate10)
   added: (has-content-person person14 medicine) (empty-arm drone1 right)
   goals met: 6 of 16
25. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 7 of 16
26. (pick-up-crate crate9 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate9 depot)
   added: (has-crate-drone-arm drone1 right crate9)
   goals met: 7 of 16
27. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 6 of 16
28. (drop-crate loc11 person3 crate9 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate9)
   added: (has-content-person person3 medicine) (empty-arm drone1 right)
   goals met: 7 of 16
29. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 8 of 16
30. (pick-up-crate crate8 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate8 depot)
   added: (has-crate-drone-arm drone1 right crate8)
   goals met: 8 of 16
31. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 7 of 16
32. (drop-crate loc11 person5 crate8 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate8)
   added: (has-content-person person5 medicine) (empty-arm drone1 right)
   goals met: 8 of 16
33. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 9 of 16
34. (pick-up-crate crate7 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate7 depot)
   added: (has-crate-drone-arm drone1 right crate7)
   goals met: 9 of 16
35. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 8 of 16
36. (drop-crate loc10 person7 crate7 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate7)
   added: (has-content-person person7 medicine) (empty-arm drone1 right)
   goals met: 9 of 16
37. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 10 of 16
38. (pick-up-crate crate6 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate6 depot)
   added: (has-crate-drone-arm drone1 right crate6)
   goals met: 10 of 16
39. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 9 of 16
40. (drop-crate loc10 person11 crate6 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate6)
   added: (has-content-person person11 medicine) (empty-arm drone1 right)
   goals met: 10 of 16
41. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 11 of 16
42. (pick-up-crate crate5 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate5 depot)
   added: (has-crate-drone-arm drone1 right crate5)
   goals met: 11 of 16
43. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 10 of 16
44. (drop-crate loc3 person1 crate2 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person1 food) (empty-arm drone1 left)
   goals met: 11 of 16
45. (drop-crate loc3 person1 crate5 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate5)
   added: (has-content-person person1 medicine) (empty-arm drone1 right)
   goals met: 12 of 16
46. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 13 of 16
47. (pick-up-crate crate4 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate4 depot)
   added: (has-crate-drone-arm drone1 right crate4)
   goals met: 13 of 16
48. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 depot)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 13 of 16
49. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 12 of 16
50. (drop-crate loc1 person9 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person9 food) (empty-arm drone1 left)
   goals met: 13 of 16
51. (drop-crate loc1 person4 crate4 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate4)
   added: (has-content-person person4 medicine) (empty-arm drone1 right)
   goals met: 14 of 16
52. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 15 of 16
53. (pick-up-crate crate3 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate3 depot)
   added: (has-crate-drone-arm drone1 right crate3)
   goals met: 15 of 16
54. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 14 of 16
55. (drop-crate loc1 person9 crate3 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate3)
   added: (has-content-person person9 medicine) (empty-arm drone1 right)
   goals met: 15 of 16
56. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 16 of 16
